# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  ##原始coco先验
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

   ####airplane
  #- [28,31, 34,46, 56,39]  # P3/8
  #- [60,60, 83,101, 119,160]  # P4/16
  #- [126,65, 277,88, 393,202]  # P5/32

####V5_airplane_new_yolo_anchors####
  #- [43,39,  51,50,  66,63]  # P3/8
  #- [68,76,  81,74,  83,87]  # P4/16
  #- [99,95,  108,110,  132,131]  # P5/32


  #- [27,40, 37,42, 39,40]  # P3/8  # airplane_addhongqiao_new
  #- [45,38, 49,49, 69,75]  # P4/16
  #- [71,63, 87,85, 112,113]  # P5/32

  - [30,41, 38,29, 51,61]  # P3/8  # zao_airplane
  - [45,55, 56,61, 69,67]  # P4/16
  - [86,90, 111,126, 117,99]  # P5/32

  #- [29,41, 33,28, 42,31]  # P3/8  # zao_airplane_add 
  #- [55,48, 65,75, 73,62]  # P4/16
  #- [78,95, 96,82, 114,118]  # P5/32

  #- [35,33, 49,55, 65,70]  # P3/8  # zao_airplane_add_1 论文
  #- [70,58, 77,93, 94,82]  # P4/16
  #- [104,113, 114,135, 127,103]  # P5/32

  #- [31,41, 39,29, 51,55]  # P3/8  # zao_airplane_add_2
  #- [62,68, 69,84, 73,61]  # P4/16
  #- [90,89, 110,128, 124,104]  # P5/32


  #- [30,41, 38,29, 49,59]  # P3/8  # zao_airplane_滤波
  #- [60,51, 63,75, 72,64]  # P4/16
  #- [79,96, 96,82, 114,118]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args] 640
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2  320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4  160
   [-1, 3, Pyconv_BottleneckCSP, [128,True,[3, 5],[1, 4]]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8  80
   [-1, 9, Pyconv_BottleneckCSP, [256,True,[3, 5],[1, 4]]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16  40
   [-1, 9, Pyconv_BottleneckCSP, [512,True,[3, 5],[1, 4]]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32  20
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, Pyconv_BottleneckCSP, [1024,False,[3, 5],[1, 4]]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],                 #
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #40
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   #[-1, 3, BottleneckCSP, [512, False]],  # 13
   [-1, 3, Pyconv_BottleneckCSP, [512,False,[3, 5],[1, 4]]],

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, Pyconv_BottleneckCSP, [256,False,[3, 5],[1, 4]]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],               #40
   [[9,14,18], 1, Fusion_up_GCAM, [256]], 
   [[18, 19], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)
   [-1, 1, eca_layer, [512, 3]],  # 20 (P4/16-medium)
   [-1, 1, Conv, [512, 3, 2]],             #20
   #[[-1, 10], 1, Concat, [1]],  # cat head P5
   #[-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)

   [[17, 19, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
