# parameters
nc: 1  #80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  #- [39,40, 47,39, 51,50]  # P3/8  #airplane_1120
  #- [62,75, 67,62, 71,79]  # P4/16
  #- [82,70, 92,93, 117,114]  # P5/32

  #- [43,40, 56,54, 65,74]  # P3/8  #airplane_1120_add_hongqiao
  #- [75,65, 76,83, 84,73]  # P4/16
  #- [92,93, 110,107, 127,131]  # P5/32

  #- [39,40, 44,47, 44,25]  # P3/8  #airplane_1208
  #- [45,39, 53,37, 53,54]  # P4/16
  #- [72,73, 92,90, 115,120]  # P5/32

  #- [27,40, 37,42, 39,40]  # P3/8  # airplane_1120_add_hongqiao_new
  #- [45,38, 49,49, 69,75]  # P4/16
  #- [71,63, 87,85, 112,113]  # P5/32

  - [30,41, 38,29, 51,61]  # P3/8  # zao_airplane
  - [55,48, 65,75, 73,62]  # P4/16
  - [86,90, 111,126, 117,99]  # P5/32


  #- [29,41, 33,28, 42,31]  # P3/8  # zao_airplane_add
  #- [55,48, 65,75, 73,62]  # P4/16
  #- [78,95, 96,82, 114,118]  # P5/32

  #- [35,33, 49,55, 65,70]  # P3/8  # zao_airplane_add_1 论文
  #- [70,58, 77,93, 94,82]  # P4/16
  #- [104,113, 114,135, 127,103]  # P5/32

  #- [30,41, 38,29, 49,59]  # P3/8  # zao_airplane_滤波
  #- [60,51, 63,75, 72,64]  # P4/16
  #- [79,96, 96,82, 114,118]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, BottleneckCSP, [128]],  #c1, c2, n=1, shortcut=True,pyconv_kernels=[3, 5,7,9], pyconv_groups=[1, 4,8,16],e=0.5
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, BottleneckCSP, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, BottleneckCSP, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, BottleneckCSP, [1024,False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, BottleneckCSP, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, BottleneckCSP, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, BottleneckCSP, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, BottleneckCSP, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
